RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G4FR_Firmware_Library/n32g4fr_std_periph_driver/inc/n32g4fr_can.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g4fr_can.h
 * @author Nations
 * @version v1.0.0
 *
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 */
#ifndef __N32G4FR_CAN_H__
#define __N32G4FR_CAN_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g4fr.h"

/** @addtogroup N32G4FR_StdPeriph_Driver
 * @{
 */

/** @addtogroup CAN
 * @{
 */

/** @addtogroup CAN_Exported_Types
 * @{
 */

#define IS_CAN_ALL_PERIPH(PERIPH) (((PERIPH) == CAN1) || ((PERIPH) == CAN2))

/**
 * @brief  CAN init structure definition
 */

typedef struct
{
    uint16_t BaudRatePrescaler; /*!< Specifies the length of a time quantum.
                                 It ranges from 1 to 1024. */

    uint8_t OperatingMode; /*!< Specifies the CAN operating mode.
                           This parameter can be a value of
                          @ref CAN_operating_mode */

    uint8_t RSJW; /*!< Specifies the maximum number of time quanta
                          the CAN hardware is allowed to lengthen or
                          shorten a bit to perform resynchronization.
                          This parameter can be a value of
                          @ref CAN_synchronisation_jump_width */

    uint8_t TBS1; /*!< Specifies the number of time quanta in Bit
                          Segment 1. This parameter can be a value of
                          @ref CAN_time_quantum_in_bit_segment_1 */

    uint8_t TBS2; /*!< Specifies the number of time quanta in Bit
                          Segment 2.
                          This parameter can be a value of
                          @ref CAN_time_quantum_in_bit_segment_2 */

    FunctionalState TTCM; /*!< Enable or disable the time triggered
                                   communication mode. This parameter can be set
                                   either to ENABLE or DISABLE. */

    FunctionalState ABOM; /*!< Enable or disable the automatic bus-off
                                   management. This parameter can be set either
                                   to ENABLE or DISABLE. */

    FunctionalState AWKUM; /*!< Enable or disable the automatic wake-up mode.
                                   This parameter can be set either to ENABLE or
                                   DISABLE. */

    FunctionalState NART; /*!< Enable or disable the no-automatic
                                   retransmission mode. This parameter can be
                                   set either to ENABLE or DISABLE. */

    FunctionalState RFLM; /*!< Enable or disable the Receive DATFIFO Locked mode.
                                   This parameter can be set either to ENABLE
                                   or DISABLE. */

    FunctionalState TXFP; /*!< Enable or disable the transmit DATFIFO priority.
                                   This parameter can be set either to ENABLE
                                   or DISABLE. */
} CAN_InitType;

/**
 * @brief  CAN filter init structure definition
 */

typedef struct
{
    uint16_t Filter_HighId; /*!< Specifies the filter identification number (MSBs for a 32-bit
                                        configuration, first one for a 16-bit configuration).
                                        This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t Filter_LowId; /*!< Specifies the filter identification number (LSBs for a 32-bit
                                       configuration, second one for a 16-bit configuration).
                                       This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t FilterMask_HighId; /*!< Specifies the filter mask number or identification number,
                                            according to the mode (MSBs for a 32-bit configuration,
                                            first one for a 16-bit configuration).
                                            This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t FilterMask_LowId; /*!< Specifies the filter mask number or identification number,
                                           according to the mode (LSBs for a 32-bit configuration,
                                           second one for a 16-bit configuration).
                                           This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t Filter_FIFOAssignment; /*!< Specifies the DATFIFO (0 or 1) which will be assigned to the filter.
                                                This parameter can be a value of @ref CAN_filter_FIFO */

    uint8_t Filter_Num; /*!< Specifies the filter which will be initialized. It ranges from 0 to 13. */

